cmsis-svd/cmsis-svd/data/Fujitsu/MB9AF1AxL.svd
      </registers>
    </peripheral>
    <!-- PERIPHERAL "EXTI" -->
    <peripheral>
      <name>EXTI</name>
      <description>External Interrupt and NMI Control</description>
      <groupName>EXTI</groupName>
      <baseAddress>0x40030000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x14</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x18</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "EXTINT0_7" -->
      <interrupt>
        <name>EXTINT0_7</name>
        <value>4</value>
      </interrupt>
      <!-- INTERRUPT "EXTINT8_15" -->
      <interrupt>
        <name>EXTINT8_15</name>
        <value>5</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "ENIR" -->
        <register>
          <name>ENIR</name>
          <description>Enable Interrupt Request Register</description>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x807F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EN15" -->
            <field>
              <name>EN15</name>
              <description>Bit15 of ENIR</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN6" -->
            <field>
              <name>EN6</name>
              <description>Bit6 of ENIR</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN5" -->
            <field>
              <name>EN5</name>
              <description>Bit5 of ENIR</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN4" -->
            <field>
              <name>EN4</name>
              <description>Bit4 of ENIR</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN3" -->
            <field>
              <name>EN3</name>
              <description>Bit3 of ENIR</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN2" -->
            <field>
              <name>EN2</name>
              <description>Bit2 of ENIR</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN1" -->
            <field>
              <name>EN1</name>
              <description>Bit1 of ENIR</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN0" -->
            <field>
              <name>EN0</name>
              <description>Bit0 of ENIR</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EIRR" -->
        <register>
          <name>EIRR</name>
          <description>External Interrupt Request Register</description>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0000</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ER15" -->
            <field>
              <name>ER15</name>
              <description>Bit15 of EIRR</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER6" -->
            <field>
              <name>ER6</name>
              <description>Bit6 of EIRR</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER5" -->
            <field>
              <name>ER5</name>
              <description>Bit5 of EIRR</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER4" -->
            <field>
              <name>ER4</name>
              <description>Bit4 of EIRR</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER3" -->
            <field>
              <name>ER3</name>
              <description>Bit3 of EIRR</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER2" -->
            <field>
              <name>ER2</name>
              <description>Bit2 of EIRR</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER1" -->
            <field>
              <name>ER1</name>
              <description>Bit1 of EIRR</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ER0" -->
            <field>
              <name>ER0</name>
              <description>Bit0 of EIRR</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EICL" -->
        <register>
          <name>EICL</name>
          <description>External Interrupt Clear Register</description>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0x807F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ECL15" -->
            <field>
              <name>ECL15</name>
              <description>Bit15 of EICL</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL6" -->
            <field>
              <name>ECL6</name>
              <description>Bit6 of EICL</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL5" -->
            <field>
              <name>ECL5</name>
              <description>Bit5 of EICL</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL4" -->
            <field>
              <name>ECL4</name>
              <description>Bit4 of EICL</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL3" -->
            <field>
              <name>ECL3</name>
              <description>Bit3 of EICL</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL2" -->
            <field>
              <name>ECL2</name>
              <description>Bit2 of EICL</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL1" -->
            <field>
              <name>ECL1</name>
              <description>Bit1 of EICL</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECL0" -->
            <field>
              <name>ECL0</name>
              <description>Bit0 of EICL</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
